{"keras_version": "1.1.0", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"output_dim": 400, "unroll": false, "return_sequences": false, "consume_less": "cpu", "dropout_W": 0.0, "dropout_U": 0.0, "inner_activation": "hard_sigmoid", "input_length": null, "activation": "tanh", "name": "lstm_1", "inner_init": "orthogonal", "W_regularizer": null, "U_regularizer": null, "stateful": false, "batch_input_shape": [null, 5, 3], "forget_bias_init": "one", "input_dtype": "float32", "input_dim": 3, "go_backwards": false, "trainable": true, "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"output_dim": 1, "W_regularizer": null, "name": "dense_1", "b_constraint": null, "batch_input_shape": [null, 400], "activity_regularizer": null, "W_constraint": null, "input_dtype": "float32", "input_dim": 400, "activation": "linear", "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "bias": true}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_1"}}]}