{"config": [{"class_name": "LSTM", "config": {"stateful": false, "batch_input_shape": [null, 10, 4], "input_dtype": "float32", "inner_init": "orthogonal", "consume_less": "cpu", "W_regularizer": null, "dropout_U": 0.0, "forget_bias_init": "one", "input_length": null, "input_dim": 4, "unroll": false, "dropout_W": 0.0, "activation": "tanh", "go_backwards": false, "trainable": true, "name": "lstm_2", "inner_activation": "hard_sigmoid", "init": "glorot_uniform", "U_regularizer": null, "output_dim": 400, "return_sequences": false, "b_regularizer": null}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_2", "batch_input_shape": [null, 400], "input_dtype": "float32", "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 1, "input_dim": 400, "bias": true, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "name": "activation_2", "trainable": true}}], "class_name": "Sequential", "keras_version": "1.1.0"}