{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "LSTM", "config": {"init": "glorot_uniform", "U_regularizer": null, "activation": "tanh", "inner_init": "orthogonal", "consume_less": "cpu", "input_length": null, "unroll": false, "dropout_W": 0.0, "W_regularizer": null, "trainable": true, "input_dtype": "float32", "go_backwards": false, "inner_activation": "hard_sigmoid", "input_dim": 3, "return_sequences": false, "name": "lstm_1", "stateful": false, "b_regularizer": null, "forget_bias_init": "one", "output_dim": 400, "dropout_U": 0.0, "batch_input_shape": [null, 15, 3]}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_constraint": null, "output_dim": 1, "activation": "linear", "input_dim": 400, "b_regularizer": null, "b_constraint": null, "name": "dense_1", "trainable": true, "input_dtype": "float32", "bias": true, "W_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 400]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "linear"}}]}