{"config": [{"config": {"W_regularizer": null, "go_backwards": false, "name": "lstm_1", "consume_less": "cpu", "output_dim": 400, "activation": "tanh", "inner_activation": "hard_sigmoid", "unroll": false, "batch_input_shape": [null, 5, 4], "forget_bias_init": "one", "input_dim": 4, "U_regularizer": null, "init": "glorot_uniform", "input_length": null, "trainable": true, "stateful": false, "inner_init": "orthogonal", "dropout_U": 0.0, "return_sequences": false, "dropout_W": 0.0, "input_dtype": "float32", "b_regularizer": null}, "class_name": "LSTM"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "bias": true, "name": "dense_1", "output_dim": 1, "trainable": true, "activation": "linear", "input_dim": 400, "batch_input_shape": [null, 400], "b_constraint": null, "input_dtype": "float32", "activity_regularizer": null, "b_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "linear", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "keras_version": "1.1.0", "class_name": "Sequential"}