{"keras_version": "1.1.0", "config": [{"config": {"batch_input_shape": [null, null, 3], "forget_bias_init": "one", "inner_activation": "hard_sigmoid", "input_length": null, "b_regularizer": null, "name": "lstm_1", "input_dim": 3, "input_dtype": "float32", "dropout_U": 0.0, "U_regularizer": null, "activation": "tanh", "inner_init": "orthogonal", "stateful": false, "init": "glorot_uniform", "go_backwards": false, "return_sequences": false, "dropout_W": 0.0, "unroll": false, "W_regularizer": null, "trainable": true, "output_dim": 400, "consume_less": "cpu"}, "class_name": "LSTM"}, {"config": {"name": "dense_1", "b_constraint": null, "batch_input_shape": [null, 400], "input_dtype": "float32", "init": "glorot_uniform", "b_regularizer": null, "activation": "linear", "input_dim": 400, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "trainable": true, "output_dim": 1, "bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "linear"}, "class_name": "Activation"}], "class_name": "Sequential"}