{"config": [{"config": {"return_sequences": false, "consume_less": "cpu", "batch_input_shape": [null, 5, 3], "dropout_U": 0.0, "input_length": null, "input_dim": 3, "init": "glorot_uniform", "name": "lstm_1", "go_backwards": false, "inner_init": "orthogonal", "trainable": true, "W_regularizer": null, "U_regularizer": null, "unroll": false, "stateful": false, "forget_bias_init": "one", "dropout_W": 0.0, "b_regularizer": null, "input_dtype": "float32", "activation": "tanh", "inner_activation": "hard_sigmoid", "output_dim": 400}, "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "batch_input_shape": [null, 400], "W_constraint": null, "W_regularizer": null, "input_dim": 400, "b_regularizer": null, "b_constraint": null, "input_dtype": "float32", "init": "glorot_uniform", "name": "dense_1", "bias": true, "trainable": true, "activation": "linear", "output_dim": 1}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "linear", "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.1.0"}