{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"activation": "tanh", "input_dtype": "float32", "stateful": false, "U_regularizer": null, "batch_input_shape": [null, 5, 3], "inner_init": "orthogonal", "dropout_W": 0.0, "name": "lstm_1", "inner_activation": "hard_sigmoid", "forget_bias_init": "one", "output_dim": 400, "return_sequences": false, "input_dim": 3, "input_length": null, "unroll": false, "dropout_U": 0.0, "init": "glorot_uniform", "W_regularizer": null, "go_backwards": false, "b_regularizer": null, "trainable": true, "consume_less": "cpu"}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "linear", "input_dtype": "float32", "b_constraint": null, "batch_input_shape": [null, 400], "init": "glorot_uniform", "input_dim": 400, "W_regularizer": null, "name": "dense_1", "b_regularizer": null, "activity_regularizer": null, "output_dim": 1, "trainable": true, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "linear"}}], "keras_version": "1.1.0"}