{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "LSTM", "config": {"W_regularizer": null, "input_dim": 3, "name": "lstm_1", "activation": "tanh", "unroll": false, "go_backwards": false, "batch_input_shape": [null, 15, 3], "input_length": null, "dropout_U": 0.0, "U_regularizer": null, "init": "glorot_uniform", "forget_bias_init": "one", "stateful": false, "inner_init": "orthogonal", "b_regularizer": null, "output_dim": 400, "consume_less": "cpu", "trainable": true, "inner_activation": "hard_sigmoid", "dropout_W": 0.0, "input_dtype": "float32", "return_sequences": false}}, {"class_name": "Dense", "config": {"W_regularizer": null, "input_dim": 400, "batch_input_shape": [null, 400], "W_constraint": null, "name": "dense_1", "activation": "linear", "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "bias": true, "input_dtype": "float32", "output_dim": 1}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "linear"}}]}