{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "LSTM", "config": {"output_dim": 400, "forget_bias_init": "one", "dropout_U": 0.0, "W_regularizer": null, "init": "glorot_uniform", "dropout_W": 0.0, "trainable": true, "consume_less": "cpu", "U_regularizer": null, "stateful": false, "activation": "tanh", "input_length": null, "go_backwards": false, "b_regularizer": null, "name": "lstm_2", "batch_input_shape": [null, 10, 4], "unroll": false, "return_sequences": false, "input_dtype": "float32", "inner_activation": "hard_sigmoid", "input_dim": 4, "inner_init": "orthogonal"}}, {"class_name": "Dense", "config": {"output_dim": 1, "activation": "linear", "name": "dense_2", "b_constraint": null, "batch_input_shape": [null, 400], "W_regularizer": null, "input_dim": 400, "trainable": true, "bias": true, "input_dtype": "float32", "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "linear", "name": "activation_2", "trainable": true}}]}