{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "LSTM", "config": {"batch_input_shape": [null, 10, 2], "activation": "tanh", "inner_init": "orthogonal", "trainable": true, "unroll": false, "b_regularizer": null, "consume_less": "cpu", "input_length": null, "stateful": false, "return_sequences": false, "go_backwards": false, "input_dtype": "float32", "dropout_W": 0.0, "output_dim": 400, "U_regularizer": null, "inner_activation": "hard_sigmoid", "name": "lstm_2", "dropout_U": 0.0, "forget_bias_init": "one", "init": "glorot_uniform", "W_regularizer": null, "input_dim": 2}}, {"class_name": "Dense", "config": {"batch_input_shape": [null, 400], "activation": "linear", "activity_regularizer": null, "bias": true, "trainable": true, "input_dtype": "float32", "output_dim": 1, "b_regularizer": null, "W_constraint": null, "name": "dense_2", "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": 400}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_2"}}]}